      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "Fusion".
       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 
           SELECT File1 ASSIGN TO "File1.dat"
              ORGANIZATION IS LINE SEQUENTIAL.
           SELECT File1 ASSIGN TO "File2.dat"
              ORGANIZATION IS LINE SEQUENTIAL.
           SELECT File1 ASSIGN TO "File3.dat"
              ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO "output.dat"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD FILE1
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS FILE1-REC.
         01 FILE1-REC.
           05 FILE1-DATA PIC X(80).
       FD FILE2
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS FILE2-REC.
         01 FILE2-REC.
           05 FILE2-DATA PIC X(80).
       FD FILE3
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS FILE3-REC.
         01 FILE3-REC.
           05 FILE3-DATA PIC X(80).
       FD OUTPUT-FILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS OUTPUT-REC.
         01 OUTPUT-REC.
           05 OUTPUT-DATA PIC X(80).
       
       PROCEDURE DIVISION.
           OPEN INPUT FILE1.
           OPEN INPUT FILE2.
           OPEN INPUT FILE3.
           OPEN OUTPUT OUTPUT-FILE.
           READ FILE1
            AT END
           GO TO END-OF-FILE1.
           WRITE OUTPUT-REC FROM FILE1-REC.
           
       END-OF-FILE1.

       READ-FILE2.
           READ FILE2
            AT END
           GO TO END-OF-FILE2.
           WRITE OUTPUT-REC FROM FILE2-REC.
           
       END-OF-FILE2.

       READ-FILE3.
           READ FILE3
           AT END
           GO TO END-OF-FILE3.
           WRITE OUTPUT-REC FROM FILE3-REC.
           
       END-OF-FILE3.
              CLOSE FILE1.
           CLOSE FILE2.
           CLOSE FILE3.
           CLOSE OUTPUT-FILE.

           STOP RUN.



