      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MERGE-FILES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE1 ASSIGN TO "file1.dat".
           SELECT INPUT-FILE2 ASSIGN TO "file2.dat".
           SELECT INPUT-FILE3 ASSIGN TO "file3.dat".
           SELECT OUTPUT-FILE ASSIGN TO "output.dat".

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE1.
        01 INPUT-RECORD1.
         05 FIELD1 PIC X(10).
         05 FIELD2 PIC X(10).
       FD INPUT-FILE2.
        01 INPUT-RECORD2.
         05 FIELD1 PIC X(10).
         05 FIELD2 PIC X(10).
       FD INPUT-FILE3.
        01 INPUT-RECORD3.
         05 FIELD1 PIC X(10).
         05 FIELD2 PIC X(10).
       FD OUTPUT-FILE.
        01 OUTPUT-RECORD.
         05 FIELD1 PIC X(10).
         05 FIELD2 PIC X(10).

       WORKING-STORAGE SECTION.
        01 EOF-FLAG PIC X VALUE 'N'.
        01 WS-ERROR-MSG PIC X(80).

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE1.
           OPEN INPUT INPUT-FILE2.
           OPEN INPUT INPUT-FILE3.
           OPEN OUTPUT OUTPUT-FILE.

           WRITE OUTPUT-File

           

           CLOSE INPUT-FILE1 INPUT-FILE2 INPUT-FILE3 OUTPUT-FILE.
           STOP RUN.
